2D_example_backUp/0/C1
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      C1;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 10;

boundaryField
{
    bottom
    {
        type            fixedValue;
        value           uniform 10;
    }
    top
    {
        type            fixedValue;
        value           uniform 10;
    }
/*
    periodic
    {
	type            cyclic;// zeroGradient;
    }

    periodic2
    {
	type            cyclic;// zeroGradient;
    }
*/

    wall
    {
	type            zeroGradient;
    }    
}


// ************************************************************************* //
