2D_example_backUp/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    Up
    {
        solver BiCGStab;
        preconditioner Cholesky;

        tolerance 1e-15;
        relTol  1e-15;

        minIter 1;
        maxIter 5000; //5000;
    }

    p
    {
        solver          PCG;
        preconditioner  DIC;
        tolerance       1e-06;
        relTol          0;
    }

    pFinal
    {
        solver          PCG;
        preconditioner  DIC;
        tolerance       1e-06;
        relTol          0;
    }

    U
    {
        solver          BiCGStab;
        preconditioner  DILU;
        tolerance       1e-06;
        relTol          0;
    }

    blockPNP
    {
        solver          BiCGStab;//petsc;//
        preconditioner  Cholesky;
        
        tolerance       1e-20;
        relTol          1e-15;
        
        minIter         1;
        maxIter         5000;
		convergenceCriterion 1e-4;
    }
   PNPNS
   {
   	nNewtonIteration 5; 	// from controldic 
	nNSPNPIteration  150;	// from controldic 
	C1C2convergence  1e-3;	// from controldic 
	PNPNStransient no;	// from controldic 
	saveVtkFiles yes;     	// from controldic 
   }
}
blockSolver
{
    convergence 1e-3;
    pRefCell 0;
    pRefValue 0;
}

convergenceCriterion 1e-4;
PISO
{
    nCorrectors     2;
    nNonOrthogonalCorrectors 0;
    pRefCell        0;
    pRefValue       0;
}

fieldBounds
{
    U      15000;
    p      -10e4 10e4;
}

relaxationFactors
{
    fields
    {
  //      p               0.3;
    }

    equations
    {
//        U               0.7;
        k               0.7;
        epsilon         0.7;
        R               0.7;
        nuTilda         0.7;
    }
}
/*
cache
{
    grad(U);
    grad(p);
    grad(k);
    grad(omega);
    grad(epsilon);
}
*/
// ************************************************************************* //
